Revit 2027 API
SpecTypeId.SiteAngle Property
 Site Angle, in discipline Common.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId SiteAngle { get; }
Public Shared ReadOnly Property SiteAngle As ForgeTypeId
	Get
public:
static property ForgeTypeId^ SiteAngle {
	ForgeTypeId^ get ();
}
static member SiteAngle : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
SpecTypeId Class
Autodesk.Revit.DB Namespace